#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fleek-network/ursa-testnet/runs/run-zmdpW2SUvghWup7H

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
module.k8s_apps_ams3.digitalocean_domain.k8s_domains["testnet.ursa.earth"]: Refreshing state... [id=testnet.ursa.earth]
digitalocean_project.ursa: Refreshing state... [id=daa74cee-a83d-41fc-a30b-0c066ad388bb]
digitalocean_tag.ursa_bootstrap_node: Refreshing state... [id=ursa-bootstrap-node-ams3]
digitalocean_tag.ursa_node: Refreshing state... [id=ursa-node-ams3]
module.fly_ursa_gateway.fly_app.ursa_gateway: Refreshing state... [id=ursa-gateway]
module.fly_ursa_gateway.fly_ip.ursa_gateway_ipv6: Refreshing state... [id=ip_degn1rk0ne6935om]
module.fly_ursa_gateway.fly_ip.ursa_gateway_ip: Refreshing state... [id=ip_m4ro1w5w7qr1deq7]
module.fly_ursa_gateway.fly_volume.ursa_gateway_volume["yul"]: Refreshing state... [id=vol_02gk9vwwke1v76wm]
module.fly_ursa_gateway.fly_volume.ursa_gateway_volume["lax"]: Refreshing state... [id=vol_52en7r1ewp9vk6yx]
module.fly_ursa_gateway.fly_volume.ursa_gateway_volume["yyz"]: Refreshing state... [id=vol_ke628r6jlgnvwmnp]
module.fly_ursa_gateway.fly_volume.ursa_gateway_volume["lhr"]: Refreshing state... [id=vol_x915grnd2wk4n70q]
module.fly_ursa_gateway.fly_volume.ursa_gateway_volume["ewr"]: Refreshing state... [id=vol_w1q85vgo97jrzdxe]
module.fly_ursa_gateway.fly_volume.ursa_gateway_volume["ams"]: Refreshing state... [id=vol_0nylzrepj214qmkp]
module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["lhr"]: Refreshing state... [id=4d8910eb437948]
module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["yul"]: Refreshing state... [id=d5683971f4238e]
module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["ewr"]: Refreshing state... [id=4d89009fe41e87]
module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["ams"]: Refreshing state... [id=178115ef669589]
module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["lax"]: Refreshing state... [id=3d8d991fe64589]
module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["yyz"]: Refreshing state... [id=3d8d374bed1e89]
module.k8s_apps_ams3.digitalocean_record.cname_redirects["testnet.ursa.earth"]: Refreshing state... [id=356873354]
module.k8s_apps_ams3.digitalocean_loadbalancer.main: Refreshing state... [id=8d783a2e-3cf9-46d5-a7ee-53faa1711c43]
module.k8s_apps_ams3.digitalocean_kubernetes_cluster.ursa_cluster: Refreshing state... [id=f7b0bb0c-0be2-4134-ad52-294c7d6ae359]
module.k8s_apps_ams3.digitalocean_firewall.ursa_peering: Refreshing state... [id=d7d06a9f-875e-4dde-a1c4-8029b17c6d91]
module.k8s_apps_ams3.digitalocean_kubernetes_node_pool.bootstrap_pool: Refreshing state... [id=2c7d4ddc-5677-4527-b81c-11c6c9c6d327]
module.k8s_apps_ams3.kubernetes_namespace_v1.ursa: Refreshing state... [id=ursa]
module.k8s_apps_ams3.digitalocean_project_resources.project_resources: Refreshing state... [id=daa74cee-a83d-41fc-a30b-0c066ad388bb]
module.k8s_apps_ams3.helm_release.ingress_nginx: Refreshing state... [id=nginx-ingress-controller]
module.k8s_apps_ams3.kubernetes_daemonset.ursa_bootstrap_node: Refreshing state... [id=ursa/ursa-bootstrap-node]
module.k8s_apps_ams3.kubernetes_daemonset.ursa_node: Refreshing state... [id=ursa/ursa-node]
module.k8s_apps_ams3.kubernetes_service_v1.ursa: Refreshing state... [id=ursa/ursa-service]
module.k8s_apps_ams3.kubernetes_ingress_v1.default_cluster_ingress: Refreshing state... [id=ursa/ursa-ams3-ingress]
module.k8s_apps_ams3.digitalocean_record.a_records["testnet.ursa.earth"]: Refreshing state... [id=356873937]
module.k8s_apps_ams3.helm_release.cert-manager: Refreshing state... [id=cert-manager]
module.k8s_apps_ams3.helm_release.cluster-issuer: Refreshing state... [id=cluster-issuer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["ams"] will be updated in-place
  ~ resource "fly_machine" "ursa_gateway_machine" {
      ~ cputype   = "shared" -> (known after apply)
      ~ env       = {} -> (known after apply)
      ~ id        = "178115ef669589" -> (known after apply)
        name      = "ursa-gateway-ams"
      ~ privateip = "fdaa:1:284c:a7b:aa3:7350:83e8:2" -> (known after apply)
      ~ services  = [
          ~ {
              ~ internal_port = 8080 -> 80
                # (2 unchanged attributes hidden)
            },
        ]
        # (5 unchanged attributes hidden)
    }

  # module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["ewr"] will be updated in-place
  ~ resource "fly_machine" "ursa_gateway_machine" {
      ~ cputype   = "shared" -> (known after apply)
      ~ env       = {} -> (known after apply)
      ~ id        = "4d89009fe41e87" -> (known after apply)
        name      = "ursa-gateway-ewr"
      ~ privateip = "fdaa:1:284c:a7b:21a1:6674:57c7:2" -> (known after apply)
      ~ services  = [
          ~ {
              ~ internal_port = 8080 -> 80
                # (2 unchanged attributes hidden)
            },
        ]
        # (5 unchanged attributes hidden)
    }

  # module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["lax"] will be updated in-place
  ~ resource "fly_machine" "ursa_gateway_machine" {
      ~ cputype   = "shared" -> (known after apply)
      ~ env       = {} -> (known after apply)
      ~ id        = "3d8d991fe64589" -> (known after apply)
        name      = "ursa-gateway-lax"
      ~ privateip = "fdaa:1:284c:a7b:85:f78f:2930:2" -> (known after apply)
      ~ services  = [
          ~ {
              ~ internal_port = 8080 -> 80
                # (2 unchanged attributes hidden)
            },
        ]
        # (5 unchanged attributes hidden)
    }

  # module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["lhr"] will be updated in-place
  ~ resource "fly_machine" "ursa_gateway_machine" {
      ~ cputype   = "shared" -> (known after apply)
      ~ env       = {} -> (known after apply)
      ~ id        = "4d8910eb437948" -> (known after apply)
        name      = "ursa-gateway-lhr"
      ~ privateip = "fdaa:1:284c:a7b:a98:f572:e809:2" -> (known after apply)
      ~ services  = [
          ~ {
              ~ internal_port = 8080 -> 80
                # (2 unchanged attributes hidden)
            },
        ]
        # (5 unchanged attributes hidden)
    }

  # module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["yul"] will be updated in-place
  ~ resource "fly_machine" "ursa_gateway_machine" {
      ~ cputype   = "shared" -> (known after apply)
      ~ env       = {} -> (known after apply)
      ~ id        = "d5683971f4238e" -> (known after apply)
        name      = "ursa-gateway-yul"
      ~ privateip = "fdaa:1:284c:a7b:b72a:ac9a:2a4d:2" -> (known after apply)
      ~ services  = [
          ~ {
              ~ internal_port = 8080 -> 80
                # (2 unchanged attributes hidden)
            },
        ]
        # (5 unchanged attributes hidden)
    }

  # module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["yyz"] will be updated in-place
  ~ resource "fly_machine" "ursa_gateway_machine" {
      ~ cputype   = "shared" -> (known after apply)
      ~ env       = {} -> (known after apply)
      ~ id        = "3d8d374bed1e89" -> (known after apply)
        name      = "ursa-gateway-yyz"
      ~ privateip = "fdaa:1:284c:a7b:88db:9de1:c287:2" -> (known after apply)
      ~ services  = [
          ~ {
              ~ internal_port = 8080 -> 80
                # (2 unchanged attributes hidden)
            },
        ]
        # (5 unchanged attributes hidden)
    }

  # module.k8s_apps_ams3.kubernetes_daemonset.ursa_bootstrap_node will be updated in-place
  ~ resource "kubernetes_daemonset" "ursa_bootstrap_node" {
        id               = "ursa/ursa-bootstrap-node"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/fleek-network/ursa:main" -> "ghcr.io/fleek-network/ursa:latest"
                        name                       = "ursa-bootstrap"
                        # (8 unchanged attributes hidden)

                        # (6 unchanged blocks hidden)
                    }

                    # (2 unchanged blocks hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.k8s_apps_ams3.kubernetes_daemonset.ursa_node will be updated in-place
  ~ resource "kubernetes_daemonset" "ursa_node" {
        id               = "ursa/ursa-node"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/fleek-network/ursa:main" -> "ghcr.io/fleek-network/ursa:latest"
                        name                       = "ursa"
                        # (8 unchanged attributes hidden)

                        # (6 unchanged blocks hidden)
                    }

                    # (2 unchanged blocks hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.k8s_apps_ams3.kubernetes_ingress_v1.default_cluster_ingress will be updated in-place
  ~ resource "kubernetes_ingress_v1" "default_cluster_ingress" {
        id     = "ursa/ursa-ams3-ingress"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              ~ "cert-manager.io/cluster-issuer"       = "letsencrypt-prod" -> "letsencrypt-staging"
                # (3 unchanged elements hidden)
            }
            name             = "ursa-ams3-ingress"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 9 to change, 0 to destroy.


```
</details>
*Pushed by: @b0xtch, Action: `pull_request`*